---
title: StructuralSectionUtils
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# StructuralSectionUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StructuralSectionErrorCode GetStructuralElementDefinitionData(Document, ElementId, StructuralElementDefinitionData&)` | `StructuralSectionUtils.GetStructuralElementDefinitionData(document, elementId, data)` | StructuralSectionErrorCode |
| `StructuralSection GetStructuralSection(Document, ElementId)` | `StructuralSectionUtils.GetStructuralSection(document, elementId)` | StructuralSection |
| `Boolean SetStructuralSection(Document, ElementId, StructuralSection)` | `StructuralSectionUtils.SetStructuralSection(document, familySymbolId, structuralSection)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```